# FilterNumericEquals Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericEquals Constructor
FilterNumericEquals Class See Also
---
Constructs an instance of FilterNumericEquals.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterNumericEquals()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterNumericEquals()
```

# See Also
FilterNumericEquals Class
Autodesk.Revit.DB Namespace